MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6M5BH2CBG/mcu.h
/* =========================================================================================================================== */
/* ================                                         R_ECCMB0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief CANFD ECC (R_ECCMB0)
 */

typedef struct                          /*!< (@ 0x4036F200) R_ECCMB0 Structure                                         */
{
    union
    {
        __IOM uint32_t EC710CTL;        /*!< (@ 0x00000000) ECC Control Register                                       */

        struct
        {
            __IM uint32_t  ECEMF   : 1; /*!< [0..0] ECC Error Message Flag                                             */
            __IM uint32_t  ECER1F  : 1; /*!< [1..1] ECC Error Detection and Correction Flag                            */
            __IM uint32_t  ECER2F  : 1; /*!< [2..2] 2-bit ECC Error Detection Flag                                     */
            __IOM uint32_t EC1EDIC : 1; /*!< [3..3] ECC 1-bit Error Detection Interrupt Control                        */
            __IOM uint32_t EC2EDIC : 1; /*!< [4..4] ECC 2-bit Error Detection Interrupt Control                        */
            __IOM uint32_t EC1ECP  : 1; /*!< [5..5] ECC 1-bit Error Correction Permission                              */
            __IOM uint32_t ECERVF  : 1; /*!< [6..6] ECC Error Judgment Enable Flag                                     */
            uint32_t               : 2;
            __IOM uint32_t ECER1C  : 1; /*!< [9..9] Accumulating ECC Error Detection and Correction Flag
                                         *   Clear                                                                     */
            __IOM uint32_t ECER2C  : 1; /*!< [10..10] 2-bit ECC Error Detection Flag Clear                             */
            __IM uint32_t  ECOVFF  : 1; /*!< [11..11] ECC Overflow Detection Flag                                      */
            uint32_t               : 2;
            __IOM uint32_t EMCA    : 2; /*!< [15..14] Access Control to ECC Mode Select bit                            */
            __IM uint32_t  ECSEDF0 : 1; /*!< [16..16] ECC Single bit Error Address Detection Flag                      */
            __IM uint32_t  ECDEDF0 : 1; /*!< [17..17] ECC Dual Bit Error Address Detection Flag                        */
            uint32_t               : 14;
        } EC710CTL_b;
    };

    union
    {
        __IOM uint16_t EC710TMC;       /*!< (@ 0x00000004) ECC Test Mode Control Register                             */

        struct
        {
            uint16_t              : 1;
            __IOM uint16_t ECDCS  : 1; /*!< [1..1] ECC Decode Input Select                                            */
            uint16_t              : 5;
            __IOM uint16_t ECTMCE : 1; /*!< [7..7] ECC Test Mode Control Enable                                       */
            uint16_t              : 6;
            __IOM uint16_t ETMA   : 2; /*!< [15..14] ECC Test Mode Bit Access Control                                 */
        } EC710TMC_b;
    };
    __IM uint16_t RESERVED;
    __IM uint32_t RESERVED1;

    union
    {
        __IOM uint32_t EC710TED;       /*!< (@ 0x0000000C) ECC Test Substitute Data Register                          */

        struct
        {
            __IOM uint32_t ECEDB : 32; /*!< [31..0] ECC Test Substitute Data                                          */
        } EC710TED_b;
    };

    union
    {
        __IM uint32_t EC710EAD0;       /*!< (@ 0x00000010) ECC Error Address Register                                 */

        struct
        {
            __IM uint32_t ECEAD : 10;  /*!< [9..0] ECC Error Address                                                  */
            uint32_t            : 22;
        } EC710EAD0_b;
    };
} R_ECCMB0_Type;                       /*!< Size = 20 (0x14)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_FLAD                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Data Flash (R_FLAD)
 */

typedef struct                         /*!< (@ 0x407FC000) R_FLAD Structure                                           */
{
    __IM uint8_t RESERVED[64];

    union
    {
        __IOM uint8_t FCKMHZ;          /*!< (@ 0x00000040) Data Flash Access Frequency Register                       */

        struct
        {
            __IOM uint8_t FCKMHZ : 8;  /*!< [7..0] Data Flash Access Frequency Register                               */
        } FCKMHZ_b;
    };
} R_FLAD_Type;                         /*!< Size = 65 (0x41)                                                          */

/** @} */ /* End of group Device_Peripheral_peripherals */

/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

 #define R_ADC0_BASE            0x40170000UL
 #define R_ADC1_BASE            0x40170200UL
 #define R_PSCU_BASE            0x400E0000UL
 #define R_BUS_BASE             0x40003000UL
 #define R_CAC_BASE             0x40083600UL
 #define R_CANFD_BASE           0x400B0000UL
 #define R_CRC_BASE             0x40108000UL
 #define R_CTSU_BASE            0x400D0000UL
 #define R_DAC_BASE             0x40171000UL
 #define R_DEBUG_BASE           0x4001B000UL
 #define R_DMA_BASE             0x40005200UL
 #define R_DMAC0_BASE           0x40005000UL
 #define R_DMAC1_BASE           0x40005040UL
 #define R_DMAC2_BASE           0x40005080UL
 #define R_DMAC3_BASE           0x400050C0UL
 #define R_DMAC4_BASE           0x40005100UL
 #define R_DMAC5_BASE           0x40005140UL
 #define R_DMAC6_BASE           0x40005180UL
 #define R_DMAC7_BASE           0x400051C0UL
 #define R_DOC_BASE             0x40109000UL
 #define R_DTC_BASE             0x40005400UL
 #define R_ELC_BASE             0x40082000UL
 #define R_ETHERC0_BASE         0x40114100UL
 #define R_ETHERC_EDMAC_BASE    0x40114000UL
 #define R_FACI_HP_CMD_BASE     0x407E0000UL
 #define R_FACI_HP_BASE         0x407FE000UL
 #define R_FCACHE_BASE          0x4001C000UL
 #define R_GPT0_BASE            0x40169000UL
 #define R_GPT1_BASE            0x40169100UL
 #define R_GPT2_BASE            0x40169200UL
 #define R_GPT3_BASE            0x40169300UL
 #define R_GPT4_BASE            0x40169400UL
 #define R_GPT5_BASE            0x40169500UL
 #define R_GPT6_BASE            0x40169600UL
 #define R_GPT7_BASE            0x40169700UL
 #define R_GPT8_BASE            0x40169800UL
 #define R_GPT9_BASE            0x40169900UL
 #define R_GPT10_BASE           0x40169A00UL
 #define R_GPT11_BASE           0x40169B00UL
 #define R_GPT12_BASE           0x40169C00UL
 #define R_GPT13_BASE           0x40169D00UL
 #define R_GPT_OPS_BASE         0x40169A00UL
 #define R_GPT_POEG0_BASE       0x4008A000UL
 #define R_GPT_POEG1_BASE       0x4008A100UL
 #define R_GPT_POEG2_BASE       0x4008A200UL
 #define R_GPT_POEG3_BASE       0x4008A300UL
 #define R_ICU_BASE             0x40006000UL
 #define R_IIC0_BASE            0x4009F000UL
 #define R_IIC1_BASE            0x4009F100UL
 #define R_IIC2_BASE            0x4009F200UL
 #define R_IWDT_BASE            0x40083200UL
 #define R_I3C0_BASE            0x4011F000UL
 #define R_I3C1_BASE            0x4011F400UL
 #define R_MPU_MMPU_BASE        0x40000000UL
 #define R_MPU_SPMON_BASE       0x40000D00UL
 #define R_MSTP_BASE            0x40084000UL
 #define R_PORT0_BASE           0x40080000UL
 #define R_PORT1_BASE           0x40080020UL
 #define R_PORT2_BASE           0x40080040UL
 #define R_PORT3_BASE           0x40080060UL
 #define R_PORT4_BASE           0x40080080UL
 #define R_PORT5_BASE           0x400800A0UL
 #define R_PORT6_BASE           0x400800C0UL
 #define R_PORT7_BASE           0x400800E0UL
 #define R_PORT8_BASE           0x40080100UL
 #define R_PORT9_BASE           0x40080120UL
 #define R_PORT10_BASE          0x40080140UL
 #define R_PORT11_BASE          0x40080160UL
 #define R_PORT12_BASE          0x40080180UL
 #define R_PORT13_BASE          0x400801A0UL
 #define R_PORT14_BASE          0x400801C0UL
 #define R_PFS_BASE             0x40080800UL
 #define R_PMISC_BASE           0x40080D00UL
 #define R_QSPI_BASE            0x64000000UL
 #define R_RTC_BASE             0x40083000UL
 #define R_SCI0_BASE            0x40118000UL
 #define R_SCI1_BASE            0x40118100UL
 #define R_SCI2_BASE            0x40118200UL
 #define R_SCI3_BASE            0x40118300UL
 #define R_SCI4_BASE            0x40118400UL
 #define R_SCI5_BASE            0x40118500UL
 #define R_SCI6_BASE            0x40118600UL
 #define R_SCI7_BASE            0x40118700UL
 #define R_SCI8_BASE            0x40118800UL
 #define R_SCI9_BASE            0x40118900UL
 #define R_SDHI0_BASE           0x40092000UL
 #define R_SDHI1_BASE           0x40092400UL
 #define R_SPI0_BASE            0x4011A000UL
 #define R_SPI1_BASE            0x4011A100UL
 #define R_SPI2_BASE            0x40072200UL
 #define R_SRAM_BASE            0x40002000UL
 #define R_SSI0_BASE            0x4009D000UL
 #define R_SSI1_BASE            0x4009D100UL
 #define R_SYSTEM_BASE          0x4001E000UL
 #define R_TSN_CAL_BASE         0x407FB17CUL
 #define R_TSN_CTRL_BASE        0x400F3000UL
 #define R_USB_FS0_BASE         0x40090000UL
 #define R_WDT_BASE             0x40083400UL
 #define R_TZF_BASE             0x40000E00UL
 #define R_CACHE_BASE           0x40007000UL
 #define R_CPSCU_BASE           0x40008000UL
 #define R_CEC_BASE             0x400AC000UL
 #define R_OSPI_BASE            0x400A6000UL
 #define R_USB_HS0_BASE         0x40111000UL
 #define R_AGTX0_BASE           0x400E8000UL
 #define R_AGTX1_BASE           0x400E8100UL
 #define R_AGTX2_BASE           0x400E8200UL
 #define R_AGTX3_BASE           0x400E8300UL
 #define R_AGTX4_BASE           0x400E8400UL
 #define R_AGTX5_BASE           0x400E8500UL
 #define R_AGTX6_BASE           0x400E8600UL
 #define R_AGTX7_BASE           0x400E8700UL
 #define R_AGTX8_BASE           0x400E8800UL
 #define R_AGTX9_BASE           0x400E8900UL
 #define R_ECCMB0_BASE          0x4036F200UL
 #define R_ECCMB1_BASE          0x4036F300UL
 #define R_FLAD_BASE            0x407FC000UL
 #define R_WDT1_BASE            0x40044300UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_declaration
 * @{
 */

 #define R_ADC0            ((R_ADC0_Type *) R_ADC0_BASE)
 #define R_ADC1            ((R_ADC0_Type *) R_ADC1_BASE)
 #define R_PSCU            ((R_PSCU_Type *) R_PSCU_BASE)
 #define R_BUS             ((R_BUS_Type *) R_BUS_BASE)
 #define R_CAC             ((R_CAC_Type *) R_CAC_BASE)
 #define R_CANFD           ((R_CANFD_Type *) R_CANFD_BASE)
 #define R_CRC             ((R_CRC_Type *) R_CRC_BASE)
 #define R_CTSU            ((R_CTSU_Type *) R_CTSU_BASE)
 #define R_DAC             ((R_DAC_Type *) R_DAC_BASE)
 #define R_DEBUG           ((R_DEBUG_Type *) R_DEBUG_BASE)
 #define R_DMA             ((R_DMA_Type *) R_DMA_BASE)
 #define R_DMAC0           ((R_DMAC0_Type *) R_DMAC0_BASE)
 #define R_DMAC1           ((R_DMAC0_Type *) R_DMAC1_BASE)
 #define R_DMAC2           ((R_DMAC0_Type *) R_DMAC2_BASE)
 #define R_DMAC3           ((R_DMAC0_Type *) R_DMAC3_BASE)
 #define R_DMAC4           ((R_DMAC0_Type *) R_DMAC4_BASE)
 #define R_DMAC5           ((R_DMAC0_Type *) R_DMAC5_BASE)
 #define R_DMAC6           ((R_DMAC0_Type *) R_DMAC6_BASE)
 #define R_DMAC7           ((R_DMAC0_Type *) R_DMAC7_BASE)
 #define R_DOC             ((R_DOC_Type *) R_DOC_BASE)
 #define R_DTC             ((R_DTC_Type *) R_DTC_BASE)
 #define R_ELC             ((R_ELC_Type *) R_ELC_BASE)
 #define R_ETHERC0         ((R_ETHERC0_Type *) R_ETHERC0_BASE)
 #define R_ETHERC_EDMAC    ((R_ETHERC_EDMAC_Type *) R_ETHERC_EDMAC_BASE)
 #define R_FACI_HP_CMD     ((R_FACI_HP_CMD_Type *) R_FACI_HP_CMD_BASE)
 #define R_FACI_HP         ((R_FACI_HP_Type *) R_FACI_HP_BASE)
 #define R_FCACHE          ((R_FCACHE_Type *) R_FCACHE_BASE)
 #define R_GPT0            ((R_GPT0_Type *) R_GPT0_BASE)
 #define R_GPT1            ((R_GPT0_Type *) R_GPT1_BASE)
 #define R_GPT2            ((R_GPT0_Type *) R_GPT2_BASE)
 #define R_GPT3            ((R_GPT0_Type *) R_GPT3_BASE)
 #define R_GPT4            ((R_GPT0_Type *) R_GPT4_BASE)
 #define R_GPT5            ((R_GPT0_Type *) R_GPT5_BASE)
 #define R_GPT6            ((R_GPT0_Type *) R_GPT6_BASE)
 #define R_GPT7            ((R_GPT0_Type *) R_GPT7_BASE)
 #define R_GPT8            ((R_GPT0_Type *) R_GPT8_BASE)
 #define R_GPT9            ((R_GPT0_Type *) R_GPT9_BASE)
 #define R_GPT10           ((R_GPT0_Type *) R_GPT10_BASE)
 #define R_GPT11           ((R_GPT0_Type *) R_GPT11_BASE)
 #define R_GPT12           ((R_GPT0_Type *) R_GPT12_BASE)
 #define R_GPT13           ((R_GPT0_Type *) R_GPT13_BASE)
 #define R_GPT_OPS         ((R_GPT_OPS_Type *) R_GPT_OPS_BASE)
 #define R_GPT_POEG0       ((R_GPT_POEG0_Type *) R_GPT_POEG0_BASE)
 #define R_GPT_POEG1       ((R_GPT_POEG0_Type *) R_GPT_POEG1_BASE)
 #define R_GPT_POEG2       ((R_GPT_POEG0_Type *) R_GPT_POEG2_BASE)
 #define R_GPT_POEG3       ((R_GPT_POEG0_Type *) R_GPT_POEG3_BASE)
 #define R_ICU             ((R_ICU_Type *) R_ICU_BASE)
 #define R_IIC0            ((R_IIC0_Type *) R_IIC0_BASE)
 #define R_IIC1            ((R_IIC0_Type *) R_IIC1_BASE)
 #define R_IIC2            ((R_IIC0_Type *) R_IIC2_BASE)
 #define R_IWDT            ((R_IWDT_Type *) R_IWDT_BASE)
 #define R_I3C0            ((R_I3C0_Type *) R_I3C0_BASE)
 #define R_I3C1            ((R_I3C0_Type *) R_I3C1_BASE)
 #define R_MPU_MMPU        ((R_MPU_MMPU_Type *) R_MPU_MMPU_BASE)
 #define R_MPU_SPMON       ((R_MPU_SPMON_Type *) R_MPU_SPMON_BASE)
 #define R_MSTP            ((R_MSTP_Type *) R_MSTP_BASE)
 #define R_PORT0           ((R_PORT0_Type *) R_PORT0_BASE)
 #define R_PORT1           ((R_PORT0_Type *) R_PORT1_BASE)
 #define R_PORT2           ((R_PORT0_Type *) R_PORT2_BASE)
 #define R_PORT3           ((R_PORT0_Type *) R_PORT3_BASE)
 #define R_PORT4           ((R_PORT0_Type *) R_PORT4_BASE)
 #define R_PORT5           ((R_PORT0_Type *) R_PORT5_BASE)
 #define R_PORT6           ((R_PORT0_Type *) R_PORT6_BASE)
 #define R_PORT7           ((R_PORT0_Type *) R_PORT7_BASE)
 #define R_PORT8           ((R_PORT0_Type *) R_PORT8_BASE)
 #define R_PORT9           ((R_PORT0_Type *) R_PORT9_BASE)
 #define R_PORT10          ((R_PORT0_Type *) R_PORT10_BASE)
 #define R_PORT11          ((R_PORT0_Type *) R_PORT11_BASE)
 #define R_PORT12          ((R_PORT0_Type *) R_PORT12_BASE)
 #define R_PORT13          ((R_PORT0_Type *) R_PORT13_BASE)
 #define R_PORT14          ((R_PORT0_Type *) R_PORT14_BASE)
 #define R_PFS             ((R_PFS_Type *) R_PFS_BASE)
 #define R_PMISC           ((R_PMISC_Type *) R_PMISC_BASE)
 #define R_QSPI            ((R_QSPI_Type *) R_QSPI_BASE)
 #define R_RTC             ((R_RTC_Type *) R_RTC_BASE)
 #define R_SCI0            ((R_SCI0_Type *) R_SCI0_BASE)
 #define R_SCI1            ((R_SCI0_Type *) R_SCI1_BASE)
 #define R_SCI2            ((R_SCI0_Type *) R_SCI2_BASE)
 #define R_SCI3            ((R_SCI0_Type *) R_SCI3_BASE)
 #define R_SCI4            ((R_SCI0_Type *) R_SCI4_BASE)
 #define R_SCI5            ((R_SCI0_Type *) R_SCI5_BASE)
 #define R_SCI6            ((R_SCI0_Type *) R_SCI6_BASE)
 #define R_SCI7            ((R_SCI0_Type *) R_SCI7_BASE)
 #define R_SCI8            ((R_SCI0_Type *) R_SCI8_BASE)
 #define R_SCI9            ((R_SCI0_Type *) R_SCI9_BASE)
 #define R_SDHI0           ((R_SDHI0_Type *) R_SDHI0_BASE)
 #define R_SDHI1           ((R_SDHI0_Type *) R_SDHI1_BASE)
 #define R_SPI0            ((R_SPI0_Type *) R_SPI0_BASE)
 #define R_SPI1            ((R_SPI0_Type *) R_SPI1_BASE)
 #define R_SPI2            ((R_SPI0_Type *) R_SPI2_BASE)
 #define R_SRAM            ((R_SRAM_Type *) R_SRAM_BASE)
 #define R_SSI0            ((R_SSI0_Type *) R_SSI0_BASE)
 #define R_SSI1            ((R_SSI0_Type *) R_SSI1_BASE)
 #define R_SYSTEM          ((R_SYSTEM_Type *) R_SYSTEM_BASE)
 #define R_TSN_CAL         ((R_TSN_CAL_Type *) R_TSN_CAL_BASE)
 #define R_TSN_CTRL        ((R_TSN_CTRL_Type *) R_TSN_CTRL_BASE)
 #define R_USB_FS0         ((R_USB_FS0_Type *) R_USB_FS0_BASE)
 #define R_WDT             ((R_WDT_Type *) R_WDT_BASE)
 #define R_TZF             ((R_TZF_Type *) R_TZF_BASE)
 #define R_CACHE           ((R_CACHE_Type *) R_CACHE_BASE)
 #define R_CPSCU           ((R_CPSCU_Type *) R_CPSCU_BASE)
 #define R_CEC             ((R_CEC_Type *) R_CEC_BASE)
 #define R_OSPI            ((R_OSPI_Type *) R_OSPI_BASE)
 #define R_USB_HS0         ((R_USB_HS0_Type *) R_USB_HS0_BASE)
 #define R_AGT0            ((R_AGTX0_Type *) R_AGTX0_BASE)
 #define R_AGT1            ((R_AGTX0_Type *) R_AGTX1_BASE)
 #define R_AGT2            ((R_AGTX0_Type *) R_AGTX2_BASE)
 #define R_AGT3            ((R_AGTX0_Type *) R_AGTX3_BASE)
 #define R_AGT4            ((R_AGTX0_Type *) R_AGTX4_BASE)
 #define R_AGT5            ((R_AGTX0_Type *) R_AGTX5_BASE)
 #define R_AGT6            ((R_AGTX0_Type *) R_AGTX6_BASE)
 #define R_AGT7            ((R_AGTX0_Type *) R_AGTX7_BASE)
 #define R_AGT8            ((R_AGTX0_Type *) R_AGTX8_BASE)
 #define R_AGT9            ((R_AGTX0_Type *) R_AGTX9_BASE)
 #define R_ECCMB0          ((R_ECCMB0_Type *) R_ECCMB0_BASE)
 #define R_ECCMB1          ((R_ECCMB0_Type *) R_ECCMB1_BASE)
 #define R_FLAD            ((R_FLAD_Type *) R_FLAD_BASE)
 #define R_WDT1            ((R_WDT_Type *) R_WDT1_BASE)

